{"backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "batch_input_shape": [null, 28, 28, 1], "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "valid", "kernel_regularizer": null, "activation": "relu", "name": "conv2d_1", "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "data_format": "channels_last", "filters": 16}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "valid", "kernel_regularizer": null, "name": "conv2d_2", "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "data_format": "channels_last", "filters": 32}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "valid", "kernel_regularizer": null, "name": "conv2d_3", "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "data_format": "channels_last", "filters": 64}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "name": "dense_1", "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "units": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_1", "rate": 0.5, "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "name": "dense_2", "bias_regularizer": null, "kernel_constraint": null, "activation": "softmax", "units": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}]}}